src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ScannedImageFormats.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ScannedImageFormats</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>BMP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JPG</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GIF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PNG</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TIF</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ScannedImageResolutions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ScannedImageResolutions</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>dpi200</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dpi300</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dpi600</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dpi1200</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ImageChromaticities.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ImageChromaticities</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Monochrome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GrayGradations</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Coloured</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ImageRotation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ImageRotation</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NoRotation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToTheRightAt90</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToTheRightAt180</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToTheLeftAt90</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/PaperSizes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>PaperSizes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NotDefined</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>A3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>A4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>A5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>B4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>B5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>B6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>C4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>C5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>C6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USExecutive</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USLegal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>USLetter</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Files/Forms/ScanningResult/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	If Parameters.Property("FileOwner") Then
		FileOwner = Parameters.FileOwner;
	EndIf;
	
	ClientID = Parameters.ClientID;
	
	If Parameters.Property("DoNotOpenCardAfterCreateFromFile") Then
		DoNotOpenCardAfterCreateFromFile = Parameters.DoNotOpenCardAfterCreateFromFile;
	EndIf;
	
	Number = FileOperations.GetNewScanNumber(FileOwner);
	FileName = Format(Number, "ND1=9; NLZ=; NG=0");

	FormatOfScannedImage = 
		CommonSettingsStorage.Load("ScanSettings/FormatOfScannedImage", ClientID);
	If FormatOfScannedImage = Undefined Then
		FormatOfScannedImage = Enums.ScannedImageFormats.PNG;
		CommonSettingsStorage.Save("ScanSettings/FormatOfScannedImage", ClientID, FormatOfScannedImage);
	EndIf;
	PictureFormat = String(FormatOfScannedImage);
	
	ResolutionEnum = CommonSettingsStorage.Load("ScanSettings/Resolution", ClientID);
	ChromaticityEnum =  CommonSettingsStorage.Load("ScanSettings/Chromaticity", ClientID);
	
	RotationEnum = CommonSettingsStorage.Load("ScanSettings/Rotation", ClientID);
	PaperSizeEnum =  CommonSettingsStorage.Load("ScanSettings/PaperSize", ClientID);
	
	ShowScannerDialogLoad = 
		CommonSettingsStorage.Load("ScanSettings/ShowScannerDialog", ClientID);
	If ShowScannerDialogLoad = Undefined Then
		ShowScannerDialogLoad = True;
		CommonSettingsStorage.Save("ScanSettings/ShowScannerDialog", ClientID, ShowScannerDialogLoad);
	EndIf;
	ShowScannerDialog = ShowScannerDialogLoad;
	
	DeviceName = 
		CommonSettingsStorage.Load("ScanSettings/DeviceName", ClientID);
	If DeviceName = Undefined Then
		DeviceName = "";
		CommonSettingsStorage.Save("ScanSettings/DeviceName", ClientID, DeviceName);
	EndIf;
	ScanningDeviceName = DeviceName;

	Resolution = -1;
	If ResolutionEnum = Enums.ScannedImageResolutions.dpi200 Then
		Resolution = 200; 
	ElsIf ResolutionEnum = Enums.ScannedImageResolutions.dpi300 Then
		Resolution = 300;
	ElsIf ResolutionEnum = Enums.ScannedImageResolutions.dpi600 Then
		Resolution = 600;
	ElsIf ResolutionEnum = Enums.ScannedImageResolutions.dpi1200 Then
		Resolution = 1200;
	EndIf;
	
	Chromaticity = -1;
	If ChromaticityEnum = Enums.ImageChromaticities.Monochrome Then
		Chromaticity = 0;
	ElsIf ChromaticityEnum = Enums.ImageChromaticities.GrayGradations Then
		Chromaticity = 1;
	ElsIf ChromaticityEnum = Enums.ImageChromaticities.Coloured Then
		Chromaticity = 2;
	EndIf;
	
	Rotation = 0;
	If RotationEnum = Enums.ImageRotation.NoRotation Then
		Rotation = 0;
	ElsIf RotationEnum = Enums.ImageRotation.ToTheRightAt90 Then
		Rotation = 90;
	ElsIf RotationEnum = Enums.ImageRotation.ToTheRightAt180 Then
		Rotation = 180;
	ElsIf RotationEnum = Enums.ImageRotation.ToTheLeftAt90 Then
		Rotation = 270;
	EndIf;
	
	PaperSize = 0;
	If PaperSizeEnum = Enums.PaperSizes.NotDefined Then
		PaperSize = 0;
	ElsIf PaperSizeEnum = Enums.PaperSizes.A3 Then
		PaperSize = 11;
	ElsIf PaperSizeEnum = Enums.PaperSizes.A4 Then
		PaperSize = 1;
	ElsIf PaperSizeEnum = Enums.PaperSizes.A5 Then
		PaperSize = 5;
	ElsIf PaperSizeEnum = Enums.PaperSizes.B4 Then
		PaperSize = 6;
	ElsIf PaperSizeEnum = Enums.PaperSizes.B5 Then
		PaperSize = 2;
	ElsIf PaperSizeEnum = Enums.PaperSizes.B6 Then
		PaperSize = 7;
	ElsIf PaperSizeEnum = Enums.PaperSizes.C4 Then
		PaperSize = 14;
	ElsIf PaperSizeEnum = Enums.PaperSizes.C5 Then
		PaperSize = 15;
	ElsIf PaperSizeEnum = Enums.PaperSizes.C6 Then
		PaperSize = 16;
	ElsIf PaperSizeEnum = Enums.PaperSizes.USLetter Then
		PaperSize = 3;
	ElsIf PaperSizeEnum = Enums.PaperSizes.USLegal Then
		PaperSize = 4;
	ElsIf PaperSizeEnum = Enums.PaperSizes.USExecutive Then
		PaperSize = 10;
	EndIf;
	
EndProcedure

&AtClient
Procedure OnOpen(Cancellation)
	
	If Not WorkWithScannerClient.InitializeComponent() Then
		Cancellation = True;
		Return;
	EndIf;
	
	ShowDialog = ShowScannerDialog;
	SelectedDevice = ScanningDeviceName;
	
	If SelectedDevice = "" Then
		OptionName = OpenFormModal("Catalog.Files.Form.ChoiceOfScanningDevice");
		If TypeOf(OptionName) = Type("Structure") Then
			SelectedDevice = OptionName.Value;
		EndIf;
		
		If SelectedDevice = "" Then 
			Cancellation = True;
			Return;
		EndIf;	
	EndIf;	
	
	If Resolution = -1 OR Chromaticity = -1 OR Rotation = -1 OR PaperSize = -1 Then
		
		Resolution  	= WorkWithScannerClient.GetSetting(SelectedDevice, "XRESOLUTION");
		Chromaticity   	= WorkWithScannerClient.GetSetting(SelectedDevice, "PIXELTYPE");
		Rotation  		= WorkWithScannerClient.GetSetting(SelectedDevice, "ROTATION");
		PaperSize 		= WorkWithScannerClient.GetSetting(SelectedDevice, "SUPPORTEDSIZES");
		
		SystemInfo = New SystemInfo();
		ClientID = SystemInfo.ClientID;
		
		FileOperations.ConvertAndSaveScannerParameters(Resolution, Chromaticity, 
			Rotation, PaperSize, ClientID);
	EndIf;	
	
	PictureFileName = "";
	Items.Accept.Enabled = False;
	
	TwainComponent.StartScanning(ShowDialog, SelectedDevice, PictureFormat, Resolution, Chromaticity, Rotation, PaperSize);
	
EndProcedure
                        
&AtClient
Procedure OnClose()
	If PictureAddress <> "" Then
		DeleteFromTempStorage(PictureAddress);
	EndIf;	
EndProcedure

&AtClient
Procedure Cancel(Command)
	DeleteFiles(PathToFile);
	Close();
EndProcedure

&AtClient
Procedure Rescan(Command)
	DeleteFiles(PathToFile);
	If PictureAddress <> "" Then
		DeleteFromTempStorage(PictureAddress);
	EndIf;	
	PictureAddress = "";
	
	ShowDialog = ShowScannerDialog;
	SelectedDevice = ScanningDeviceName;
	
	TwainComponent.StartScanning(ShowDialog, SelectedDevice, PictureFormat, Resolution, Chromaticity, Rotation, PaperSize);
EndProcedure

&AtClient
Procedure Accept(Command)
	Close();
	FileOperationsClient.CreateDocumentBasedOnFile(PathToFile, FileOwner, ThisForm, DoNotOpenCardAfterCreateFromFile, FileName);
	DeleteFiles(PathToFile);
EndProcedure

&AtClient
Procedure ExternalEvent(Source, Event, Data)
	
	If Source = "TWAIN" And Event = "ImageAcquired" Then
		
		PictureFileName = Data;
		Items.Accept.Enabled = True;
		
		PathToFile = PictureFileName;
		
		BinaryData 		= New BinaryData(PathToFile);
		PictureAddress 	= PutToTempStorage(BinaryData, Uuid);
		
	EndIf;	
EndProcedure
